Revit 2026 API

# IFCProductWrapperFindExtrusionCreationParameters Method

---

Obtains the extrusion creation data associated with the given element.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCExtrusionCreationData FindExtrusionCreationParameters(
	IFCAnyHandle elementHandle
)
```
```vb
Public Function FindExtrusionCreationParameters (
	elementHandle As IFCAnyHandle
) As IFCExtrusionCreationData
```
```cpp
public:
IFCExtrusionCreationData^ FindExtrusionCreationParameters(
	IFCAnyHandle^ elementHandle
)
```
```fsharp
member FindExtrusionCreationParameters :
        elementHandle : IFCAnyHandle -> IFCExtrusionCreationData
```

#### Parameters

elementHandle IFCAnyHandle
     The handle.

#### Return Value

IFCExtrusionCreationData The parameters.  if no parameters are associated with the element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace